raibisch/ESP32_DYNECALC/src/main.cpp
     sFetch += "\nFreeHeap   :";
     sFetch += String(ESP.getFreeHeap());
     sFetch += "\nMinFreeHeap:";
     sFetch += String(ESP.getMinFreeHeap());

#ifdef SG_READY
     sFetch += "\n\nEPEX NEXT DATE:";
     sFetch +=  smartgrid.getWebDate(true); //sEPEXdateNext;
     sFetch +=  "\n";
     sFetch += smartgrid.getWebHourValueString(true);

     sFetch += "\n\nEPEX TODAY:";
     sFetch +=  "\n";
     sFetch += smartgrid.getWebHourValueString(false); //sEPEXPriceToday;
     //sFetch += "\n---\n\n";
#endif
//*/
     /*
     for (size_t i = 0; i < SG_HOURSIZE; i++)
     {
       if (smartgrid.getHourVar1(i) > 0) //[i].var1 > 0)
       {
        sFetch += "\n SG-SETTING_";
        sFetch += " Hour:";
        sFetch += String(i);
        sFetch += " mode:";
        sFetch += String(smartgrid.getHourVar1(i));  //[i].var1);
       }
     }
//*/
     return sFetch;
  }
  else
  if (var =="PRICE_LOW")
  {
     return String(varStore.varEPEX_i_low);      
  }
 else
  if (var =="PRICE_HIGH")
  {
     return String(varStore.varEPEX_i_high);     
  }
  else
  if (var == "COST_MWST")
  {
    return String(varStore.varCOST_i_mwst);
  }
  else
  if (var == "COST_FIX")
  {
    return String(varStore.varCOST_f_fix);
  }
  else
  if (var == "EPEX_ARRAY")
  {
    //return  smartgrid.getWebHourValueString(false);                      //EPEXPriceToday; // jetzt TODAY !!!
    String ret = smartgrid.getWebHourValueString(false);
    if (smartgrid.getWebHourValueString(true).length() > 0)
    {
     ret += ", ";
     ret += smartgrid.getWebHourValueString(true);
    }
    return ret;
  }
  else
  if (var == "EPEX_DATE")
  {
    String ret = smartgrid.getWebDate(false);
    ret += "   -    ";
    ret += smartgrid.getWebDate(true);
    return ret;
  }
  else
  if (var == "SGMODE")
  {
    //switch (SmartGridReadyStatus)
    switch (smartgrid.getHourVar1(ntpclient.getTimeInfo()->tm_hour))
    {
    case 1:
      return "sg1";
      break;
    case 2:
      return "sg2";
      break;
    case 3:
      return "sg3";
      break;
    case 4:
      return "sg4";
      break;
    default:
      break;
    }
    return "";
  }
  else
  if (var == "SGHOURMODE")
  {
    for (size_t i = 0; i < SG_HOURSIZE; i++)
    {
      sFetch += smartgrid.getHourVar1(i); //String(smartgrid_hour[i].var1);
      if (i < SG_HOURSIZE-1)
      {
        sFetch += ',';
      }
    }
    //sFetch += '0';
    return sFetch;
  }
#ifdef CALC_HOUR_ENERGYPRICE
  else
  if (var == "COSTINFO")
  { 
     sFetch =      "Flex(ct):";
    sFetch += String((smartgrid.getUserkWhPrice(ntpclient.getTimeInfo()->tm_hour)),1);
    sFetch +=   "  Fix (cnt):";
    sFetch += String(smartgrid.getUserkWhFixPrice(),1);
   
    sFetch +=  " Hour-kWh : ";
    sFetch +=  String((smldecoder.getInputkWh() /* valSML_kwh_in */ - smartgrid.hourprice_kwh_start),3);

    sFetch += "\r\n\r\nHour-flex:";
    sFetch += String(smartgrid.getFlexprice_hour(ntpclient.getTimeInfo()->tm_hour),2);
  
    sFetch +=   "  Day-flex :";
    sFetch += String(smartgrid.getFlexprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);
    
    sFetch +=    " Month-flex:";
    sFetch += String(smartgrid.getFlexprice_month(ntpclient.getTimeInfo()->tm_mon),2);

    //sFetch +=     "\r\nSum-flex     : ";
    //sFetch += String(smartgrid.Flexprice_sum + smartgrid.getAktFlexprice(),2);

    sFetch +=    "\r\nHour-fix: ";
    sFetch += String(smartgrid.getFixprice_hour(ntpclient.getTimeInfo()->tm_hour),2);

    sFetch +=     "  Day-fix  :";
    sFetch += String(smartgrid.getFixprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);

    sFetch +=     "  Month-fix:";
    sFetch += String(smartgrid.getFixprice_month(ntpclient.getTimeInfo()->tm_mon) ,2);

    //sFetch +=     "\r\nSum-fix     : ";
    //sFetch += String(smartgrid.fixprice_sum + smartgrid.akt_fixprice,2);
    sFetch += "";

    return sFetch;
  }

  else
  if (var == "PRICE_FIX")
  {
     return String(smartgrid.getUserkWhFixPrice(),1);
  }

  else 
  if  (var == "PRICE_HOUR_FLEX")
  {
     for (size_t i = 0; i < 24; i++)
     {
      //sFetch += String(smartgrid.flexprice_hour[i],2);
      sFetch += String(smartgrid.getFlexprice_hour(i),2);
      if (i < 23)
      {
       sFetch += ", ";
      }
     }
     debug_println(sFetch);
     return sFetch;
  }
  else
  if (var == "PRICE_HOUR_FIX")
  {
     for (size_t i = 0; i <24; i++)
     {
      //sFetch += String(smartgrid.fixprice_hour[i],2);
      sFetch += String(smartgrid.getFixprice_hour(i),2);
      if (i < 23)
      {
       sFetch += ", ";
      }
     }
     return sFetch;
  }
  else
  if (var == "PRICE_MONTHDAY_FLEX")
  {
     for (size_t i = 1; i < 32; i++)
     {
      //sFetch += String(smartgrid.flexprice_monthday[i],2);
      sFetch += String(smartgrid.getFlexprice_monthday(i),2);
      if (i < 31)
      {
       sFetch += ", ";
      }
     }
     return sFetch;
  }
  else
  if (var == "PRICE_MONTHDAY_FIX")
  {
     for (size_t i = 1; i < 32; i++) // begin with "1" !!
     {
      //sFetch += String(smartgrid.fixprice_monthday[i],2);
      sFetch += String(smartgrid.getFixprice_monthday(i),2);
      if (i < 31)
      {
       sFetch += ", ";
      }
     }
     return sFetch;
  }
  else
  if (var == "PRICE_MONTH_FLEX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sFetch += String(smartgrid.flexprice_month[i],2);
      sFetch += String(smartgrid.getFlexprice_month(i),2);
      if (i < 11)
      {
       sFetch += ", ";
      }
     }
     return sFetch;
  }
  else
  if (var == "PRICE_MONTH_FIX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sFetch += String(smartgrid.fixprice_month[i],2);
      sFetch += String(smartgrid.getFixprice_month(i),2);
      if (i < 11)
      {
       sFetch += ", ";
      }
     }
     return sFetch;
  }
  else
  if (var == "COST_AKT_MONTH") // read config.txt
  {
    if (!SPIFFS.exists("/cost_akt_month.txt")) 
    {
     return String(F("Error: File 'cost_akt_month.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = SPIFFS.open("/cost_akt_month.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  else
  if (var == "COST_AKT_YEAR") // read config.txt
  {
    if (!SPIFFS.exists("/cost_akt_year.txt")) 
    {
     return String(F("Error: File 'cost_akt_year.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = SPIFFS.open("/cost_akt_year.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  #endif
  
