raibisch/ESP32_DYNECALC/src/main.cpp
  return "";
}

void notFound(AsyncWebServerRequest *request) 
{
    request->send(404, "text/plain", "Not found");
}

// for "/" and "/index" handle post
void Handle_Index_Post(AsyncWebServerRequest *request)
{
  debug_println("Argument: " + request->argName(0));
  uint8_t i = 0;
  debug_printf("Value: %s\r\n", request->arg(i));
  request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
}
#endif
  

void initWebServer()
{ 
#ifdef WEB_APP

  webserver.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    if (request->args() > 0)
    {
    debug_println("GET-Argument: " + request->argName(0));
    debug_print("Value: ");
    uint8_t i = 0;
    //String s  = request->arg(i);
    //debug_println(s);
    }
                                                                                 // Index:
    sFetch = ntpclient.getTimeString();                                          // 0 
    sFetch += ',';

    sFetch += smartgrid.getHourVar1(ntpclient.getTimeInfo()->tm_hour);           // 1
    sFetch += ',';
  #if defined SML_TASMOTA || defined SML_TIBBER
    sFetch += String(smldecoder.getWatt());                                      // 2
    sFetch += ',';
    sFetch += String(smldecoder.getInputkWh()) ;                                 // 3
    sFetch += ',';
    sFetch += String(smldecoder.getOutputkWh()) ;                                // 4
  #else
    sFetch += "0,0,0",
  #endif
    sFetch += ',';
    sFetch += String((smartgrid.getUserkWhPrice(ntpclient.getTimeInfo()->tm_hour)),1); //5
    sFetch += ",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0";
  
    request->send(200, "text/plain", sFetch);
    //debug_println("server.on /fetch: "+ s);
  });


   //Route for setup web page
  webserver.on("/meter.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/meter.html", String(), false, setHtmlVar);
  });
  //Route for setup web page
  webserver.on("/smartgrid.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/smartgrid.html", String(), false, setHtmlVar);
  });
  
  webserver.on("/sgready.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/sgready.html", String(), false, setHtmlVar);
  });


 #ifdef LUX_WEBSOCKET
 //Route for Luxtronik values
  webserver.on("/luxtronik.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/luxtronik.html", String(), false, setHtmlVar);
  });
#endif

  //Route for Energy Cost
  webserver.on("/energycost.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/energycost.html", String(), false, setHtmlVar);
  });
  

  // datafiles for direct access in Website
  webserver.on("/cost_akt_month.txt",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/cost_akt_month.txt", String(), false);
  });
  // datafiles for direct access in Website
  webserver.on("/cost_akt_year.txt",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/cost_akt_year.txt", String(), false);
  });

  
  // Basis Seiten:
  
  //Route for root / web page
  webserver.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {https://
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
  });
  //Route for root /index web page
  webserver.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
  });
 
  //Route for setup web page
  webserver.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setup.html", String(), false, setHtmlVar);
  });
  //Route for config web page
  webserver.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });


  //Route for stored values
  webserver.on("/savevalues.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/savevalues.html", String(), false, setHtmlVar);
  });

   webserver.on("/current.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/current.png", String(), false);
  });
   webserver.on("/sg.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/sg.png", String(), false);
  });
  
  webserver.on("/sgready.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/sgready.png", String(), false);
  });
  /*
  webserver.on("/heatpump.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/heatpump.png", String(), false);
  });
  */
  webserver.on("/energycost.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/energycost.png", String(), false);
  });

  //Route for Info-page
  webserver.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/info.html", String(), false, setHtmlVar);
  });

  // Route for style-sheet
  webserver.on("/style.css",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/style.css", String(), false);
  });

  // config.txt GET
  webserver.on("/config.txt", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(SPIFFS, "/config.txt", "text/html", false);
  });
  // config.txt GET
  webserver.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    //saveHistory();
    ESP.restart();
  });

  //.. some code for the navigation icons
  webserver.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/home.png", String(), false);
  });
  webserver.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/file-list.png", String(), false);
  });
  webserver.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/settings.png", String(), false);
  });
 
