raibisch/ESP32_DYNECALC/src/main.cpp
  // ...a lot of code only for icons and favicons ;-))
  webserver.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/manifest.json", String(), false);
  });
  webserver.on("/favicon.ico",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/favicon.ico", String(), false);
  });
  webserver.on("/apple-touch-icon.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/apple-touch-icon.png", String(), false);
  });
  webserver.on("/android-chrome-192x192.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-192x192.png", String(), false);
  });
  webserver.on("/android-chrome-384x384.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-384x384.png", String(), false);
  });
  

  // ------------ POSTs --------------------------------------------------------------
  // root (/) POST
  webserver.on("/",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  // index.html POST
  webserver.on("/index.html", HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });


  // sgready.html POST
  webserver.on("/sgready.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   uint8_t i = 0;
   String s  = request->arg(i);
   //AsyncWebLog.println("Requestarg:" + s);
#ifdef SG_READY
   if (s == "mode1")
   {
      setSGreadyOutput(1);
   }
   else
   if (s == "mode2")
   {
      setSGreadyOutput(2);
   }
   else
   if (s == "mode3")
   {
      setSGreadyOutput(3);
   }
   else
   if (s == "mode4")
   {
      setSGreadyOutput(4);
   }
  #endif
   request->send(SPIFFS, "/sgready.html", String(), false, setHtmlVar); 
  });
     

  // config.html POST
  webserver.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   //debug_println("Argument: " + request->argName(0));
   //debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "saveconfig")
   {
       varStore.Save(s);
       varStore.Load();
       smartgrid.refreshWebData(true); // new: 30.10.2024
       //smartgrid.getAppRules();   // old: setSmartGridRules(); // calulate rules from config
   }
   //debug_println("Request /index3.html");
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });
 
   // config.html POST
  webserver.on("/savevalues.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   //debug_println("Argument: " + request->argName(0));
   //debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println("--- POST-arg savevelues.html -----");
   debug_println(s);
   if (request->argName(0) == "savemonthday")
   {
      debug_println("\r\nMONTH_DAY");
      smartgrid.saveCost("/cost_akt_month.txt", s);
      smartgrid.loadCost_monthday();
   }
   else
   if (request->argName(0)== "savemonth")
   {
      debug_println("MONTH");
      smartgrid.saveCost("/cost_akt_year.txt", s);
      smartgrid.loadCost_month();
   }
   //debug_println("Request /index3.html");

   request->send(SPIFFS, "/savevalues.html", String(), false, setHtmlVar);
  });

  

  // init Webserver 
  sFetch.reserve(150);
  AsyncWebLog.begin(&webserver);
  AsyncWebOTA.begin(&webserver);
  webserver.onNotFound(notFound);
  webserver.begin();
#endif
}


// extra handling for M5Core-Ink Module
#ifdef M5_COREINK
Ink_Sprite TimePageSprite(&M5.M5Ink);


#define uS_TO_S_FACTOR 1000000  /* Conversion factor for micro seconds to seconds */
uint32_t timeToSleep = 3600;    // =1 hour 

RTC_SLOW_ATTR int iInit = 1;
RTC_SLOW_ATTR uint16_t rtc_userhour_price[24];

/// @brief Draw only akt. Hour and date
/// @param time 
/// @param date 
void drawTimeAndDate(RTC_TimeTypeDef time, RTC_DateTypeDef date)
{
    char buf[14] = {0};
    uint8_t next_hour = 0;
   

    //snprintf(buf, 6, "%02d:%02d", time.Hours, time.Minutes);
    //TimePageSprite.drawString(40, 20, buf, &AsciiFont24x48);

    snprintf(buf,11, "%02d.%02d.%d", (date.Date), date.Month, date.Year);
    TimePageSprite.drawString(20, 58, buf, &AsciiFont8x16);

    if (time.Hours < 23)
    { next_hour = time.Hours+1;}
    sprintf(buf, "%02d:00 - %02d:00", time.Hours, next_hour);
    TimePageSprite.drawString(20, 74, buf, &AsciiFont8x16);
}


float getBatVoltage()
{
    analogSetPinAttenuation(35,ADC_11db);
    esp_adc_cal_characteristics_t *adc_chars = (esp_adc_cal_characteristics_t *)calloc(1, sizeof(esp_adc_cal_characteristics_t));
    esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, 3600, adc_chars);
    uint16_t ADCValue = analogRead(35);
    
    uint32_t BatVolmV  = esp_adc_cal_raw_to_voltage(ADCValue,adc_chars);
    float BatVol = float(BatVolmV) * 25.1 / 5.1 / 1000;
    return BatVol;
}

void drawBatterylevel()
{
    char batteryStrBuff[64];
    sprintf(batteryStrBuff,"Batt.:%.2fV",getBatVoltage());
    TimePageSprite.drawString(20,0,batteryStrBuff,&AsciiFont8x16);
}


void drawHourPrice(uint8_t hour)
{
    char buf[20];
    //sprintf(buf, "Tibber");
    //TimePageSprite.drawString(20, 62, buf, &AsciiFont24x48); 
    sprintf(buf, "%.1f ct", float(rtc_userhour_price[hour] / 10.0));
    TimePageSprite.drawString(20, 90, buf, &AsciiFont24x48); 

    if (hour < 23)
    {
      sprintf(buf, "hour+1: %.1f ct", float(rtc_userhour_price[hour+1] / 10.0));
      TimePageSprite.drawString(20, 134, buf, &AsciiFont8x16); 
    }
}


void initM5CoreInk()
{
  RTC_TimeTypeDef time;
  RTC_DateTypeDef date;

  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();
  
  M5.begin();
  digitalWrite(LED_EXT_PIN, HIGH);

  switch(wakeup_reason)
  {
    case ESP_SLEEP_WAKEUP_EXT0 : debug_println("** Wakeup caused by external signal using RTC_IO"); break;

    case ESP_SLEEP_WAKEUP_EXT1 : debug_println("** Wakeup caused by external signal using RTC_CNTL"); break;

